app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "oauth_token", "oauth_expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    #user = User.from_omniauth(env["omniauth.auth"])

		auth = env["omniauth.auth"]
		user = User.new
	  user.provider = auth.provider
	  user.uid = auth.uid
	  user.name = auth.info.name
	  user.oauth_token = auth.credentials.token
	  user.oauth_expires_at = Time.at(auth.credentials.expires_at)
	  user.save!